// Задача 6
Console.Write("Введите число: ");
double aaa = Convert.ToInt32(Console.ReadLine());
if (aaa % 2 == 0) Console.Write("Число четное");
else Console.Write("Число нечетное");